kitcyte3/bandCode-SES/examples/ble_peripheral/ble_app_hrs_nrf51_ses/main.c
    const nrf_drv_twi_config_t twi_config = {
       .scl                = 16, //16
       .sda                = 15, //15
       .frequency          = NRF_TWI_FREQ_100K,
       .interrupt_priority = APP_IRQ_PRIORITY_HIGH,
       .clear_bus_init     = false
    };

    err_code = nrf_drv_twi_init(&m_twi, &twi_config, NULL, NULL);
    APP_ERROR_CHECK(err_code);

    nrf_drv_twi_enable(&m_twi);
}

void twi1_init (void){
        //make sure TWO0 and TWI1 are both enabled in config text file somewhere else in project
    ret_code_t err_code;

    const nrf_drv_twi_config_t twi1_config = {
       .scl                = 18, //18
       .sda                = 17, //17
       .frequency          = NRF_TWI_FREQ_100K,
       .interrupt_priority = APP_IRQ_PRIORITY_HIGH,
       .clear_bus_init     = false
    };

    err_code = nrf_drv_twi_init(&m_twi1, &twi1_config, NULL, NULL);
    APP_ERROR_CHECK(err_code);

    nrf_drv_twi_enable(&m_twi1);
}

//write to twi0
void writei2c(uint8_t deviceAddr, uint8_t reg_addr, uint8_t data_to_write_high, uint8_t data_to_write_low){
    //power on spectrum sensor
    uint8_t dataToWrite[2] = {data_to_write_high, data_to_write_low};
    ret_code_t err_code = nrf_drv_twi_tx(&m_twi, deviceAddr, &dataToWrite[0], sizeof(dataToWrite), false);
}
void writei2cSingle(uint8_t deviceAddr, uint8_t reg_addr, uint8_t data_to_write_high){
    //power on spectrum sensor
    uint8_t dataToWrite[2] = {reg_addr, data_to_write_high};
    ret_code_t err_code = nrf_drv_twi_tx(&m_twi, deviceAddr, &dataToWrite[0], sizeof(dataToWrite), false);
}

//write to twi1
void writei2c1(uint8_t deviceAddr, uint8_t reg_addr, uint8_t data_to_write_high, uint8_t data_to_write_low){
    //power on spectrum sensor
    uint8_t dataToWrite[2] = {data_to_write_high, data_to_write_low};
    ret_code_t err_code = nrf_drv_twi_tx(&m_twi1, deviceAddr, &dataToWrite[0], sizeof(dataToWrite), false);
}
void writei2cOneByte(uint8_t deviceAddr, uint8_t reg_addr, uint8_t data_to_write){
    //power on spectrum sensor
    uint8_t dataToWrite[1] = {data_to_write};
    ret_code_t err_code = nrf_drv_twi_tx(&m_twi, deviceAddr, &dataToWrite[0], sizeof(dataToWrite), false);
}

//use twi1
void writei2cOneByte1(uint8_t deviceAddr, uint8_t reg_addr, uint8_t data_to_write){
    //power on spectrum sensor
    uint8_t dataToWrite[1] = {data_to_write};
    ret_code_t err_code = nrf_drv_twi_tx(&m_twi1, deviceAddr, &dataToWrite[0], sizeof(dataToWrite), false);
}

uint16_t readi2cHighLow(uint8_t deviceAddr, uint8_t read_reg_addr){
    //ret_code_t err_code; //to hold return code, currently do nothing with it
    
    //READ 1st byte
    uint16_t data_both;
    //first half of read
    uint8_t dataToSend4[1] = {read_reg_addr};
    nrf_drv_twi_tx(&m_twi, deviceAddr, &dataToSend4[0], sizeof(dataToSend4), true);


    uint8_t read_data2[2];
    nrf_drv_twi_rx(&m_twi, deviceAddr, &read_data2[0], 2);
    //printf("addr: %x, data: 0x%x 0x%x \r\n",read_reg_addr ,read_data2[1], read_data2[0]);
    
    data_both = read_data2[0] | (read_data2[1] << 8);
    //printf("both: 0x%x \r\n",data_both);
    
    return data_both;
}

uint8_t readi2cOneByte(uint8_t deviceAddr, uint8_t read_reg_addr){
    //ret_code_t err_code; //to hold return code, currently do nothing with it
    
    //READ 1st byte
    //first half of read
    uint8_t dataToSend4[1] = {read_reg_addr};
    nrf_drv_twi_tx(&m_twi, (deviceAddr), &dataToSend4[0], sizeof(dataToSend4), true);
    
    uint8_t read_data2[1];
    nrf_drv_twi_rx(&m_twi, (deviceAddr), &read_data2[0], 1);
    return read_data2[0];
}


//use twi1
uint8_t readi2cOneByte1(uint8_t deviceAddr, uint8_t read_reg_addr){
    //ret_code_t err_code; //to hold return code, currently do nothing with it
    
    //READ 1st byte
    //first half of read
    uint8_t dataToSend4[1] = {read_reg_addr};
    nrf_drv_twi_tx(&m_twi1, (deviceAddr<<1)|0x0, &dataToSend4[0], sizeof(dataToSend4), true);
    
    uint8_t read_data2[1];
    nrf_drv_twi_rx(&m_twi1, (deviceAddr<<1)|0x1, &read_data2[0], 1);
    
    return read_data2[0];
}

bool GPIOEXP0_init(){
    //make sure twi_init() was run before this function.
    //AND make sure MUX is set to 1111
                //adr,R/!W      config hi low
    writei2c((0x22<<1), 0x0c, 0x0,0x0); //config port0 to output
    writei2c((0x22<<1), 0x0d, 0x0,0x0); //config port1 to output
    writei2c((0x22<<1), 0x0e, 0x0,0x0); //config port2 to output
    
    return 0;
}

bool GPIOEXP1_init(){
    //make sure twi_init() was run before this function.
                //adr,R/!W      config hi low
    writei2c1((0x23<<1), 0x0c, 0x0,0x0); //config port0 to output
    writei2c1((0x23<<1), 0x0d, 0x0,0x0); //config port1 to output
    writei2c1((0x23<<1), 0x0e, 0x0,0x0); //config port2 to output
    
    return 0;
}

uint8_t GPIOEXP1_readPort0(){
    return readi2cOneByte((0x23<<1)|0x1, 0x4);
}

uint8_t GPIOEXP0_readPort0(){
//  return readi2cOneByte((0x22<<1)|0x1, 0x4);
    return readi2cOneByte((0x22<<1)|0x1, 0x4);
}

bool LED_BT_blue(){
    //make sure GPIOEXP1_init was run before this function.
    uint8_t res = readi2cOneByte(0x23, 0x04); //read LED register
    res = (res & ~0x38) | (0x30 & 0x38); //0banything & 0b000[fix]111
    writei2cSingle(0x23, 0x04, res); //set Blue light closer to USB on
    return 0;
}
bool LED_BT_green(){
    //make sure GPIOEXP1_init was run before this function.
    uint8_t res = readi2cOneByte(0x23, 0x04); //read LED register
    res = (res & ~0x38) | (0x28 & 0x38); //0banything & 0b000[fix]111
    writei2cSingle(0x23, 0x04, res); //set Blue light closer to USB on
    return 0;
}
bool LED_BT_off(){
    //make sure GPIOEXP1_init was run before this function.
    uint8_t res = readi2cOneByte(0x23, 0x04); //read LED register
    res = (res & ~0x38) | (0x38 & 0x38); //0banything & 0b000[fix]111
    writei2cSingle(0x23, 0x04, res); //set Blue light closer to USB on
    return 0;
}
bool LED_PWR_red(){
    //make sure GPIOEXP1_init was run before this function.
    uint8_t res = readi2cOneByte(0x23, 0x04); //read LED register
    res = (res & ~0x07) | (0x3 & 0x07); //0banything & 0b000000[011]
    writei2cSingle(0x23, 0x04, res); //set red light away from USB ON
    return 0;
}
bool LED_PWR_green(){
    //make sure GPIOEXP1_init was run before this function.
    //see explanation in LED_BT_blue and LED_PWR_red
    uint8_t res = readi2cOneByte(0x23, 0x04); //read LED register
    res = (res & ~0x07) | (0x05 & 0x07);; //0banything & 0b000000[011]
    writei2cSingle(0x23, 0x04, res); //set green light away from USB on
    return 0;
}
bool LED_PWR_bluegreen(){
    //make sure GPIOEXP1_init was run before this function.
    //see explanation in LED_BT_blue and LED_PWR_red
    uint8_t res = readi2cOneByte(0x23, 0x04); //read LED register
    res = (res & ~0x07) | (0x04 & 0x07);; //0banything & 0b000000[011]
    writei2cSingle(0x23, 0x04, res); //set green light away from USB on
    return 0;
}
bool LED_PWR_yellow(){
    //make sure GPIOEXP1_init was run before this function.
    //see explanation in LED_BT_blue and LED_PWR_red
    uint8_t res = readi2cOneByte(0x23, 0x04); //read LED register
    res = (res & ~0x07) | (0x01 & 0x07);; //0banything & 0b000000[011]
    writei2cSingle(0x23, 0x04, res); //set green light away from USB on
    return 0;
}
bool LED_PWR_off(){
    //make sure GPIOEXP1_init was run before this function.
    //see explanation in LED_BT_blue and LED_PWR_red
    uint8_t res = readi2cOneByte(0x23, 0x04); //read LED register
    res = (res & ~0x07) | (0x07 & 0x07);; //0banything & 0b000000[011]
    writei2cSingle(0x23, 0x04, res); //set green light away from USB on
    return 0;
}
bool LED_IND1_blue(){
    MUX_set(1,1,1,1);
    //make sure GPIOEXP1_init was run before this function.
    //see explanation in LED_BT_blue and LED_PWR_red
    uint8_t res = readi2cOneByte(0x22, 0x04); //read LED register 0
    res = (res & ~0x40); //forces the blue bit to be a 0
    res = (res | 0x30); //forces the red and green bits to be 1
    writei2cSingle(0x22, 0x04, res);//set register 0
    return 0;
}
bool LED_IND2_blue(){
    MUX_set(1,1,1,1);
    //make sure GPIOEXP1_init was run before this function.
    //see explanation in LED_BT_blue and LED_PWR_red
    uint8_t res = readi2cOneByte(0x22, 0x04); //read LED register 0
    uint8_t res1 = readi2cOneByte(0x22, 0x05); //read LED register 1
    res = (res & ~0x80); //forces the blue bit to be a 0
    res1 = (res1 | 0x3); //forces the red and green bits to be 1
    writei2cSingle(0x22, 0x04, res);//set register 0
    writei2cSingle(0x22, 0x05, res1);//set register 0
    return 0;
}
bool LED_IND3_blue(){
    MUX_set(1,1,1,1);
    //make sure GPIOEXP1_init was run before this function.
    //see explanation in LED_BT_blue and LED_PWR_red
    uint8_t res = readi2cOneByte(0x22, 0x06); //read LED register 0
    res = (res & ~0x08); //forces the blue bit to be a 0
    res = (res | 0x06); //forces the red and green bits to be 1
    writei2cSingle(0x22, 0x06, res);//set register 0
    return 0;
}
bool LED_IND4_blue(){
    MUX_set(1,1,1,1);
    //make sure GPIOEXP1_init was run before this function.
    //see explanation in LED_BT_blue and LED_PWR_red
    uint8_t res = readi2cOneByte(0x22, 0x06); //read LED register 0
    res = (res & ~0x40); //forces the blue bit to be a 0
    res = (res | 0x30); //forces the red and green bits to be 1
    writei2cSingle(0x22, 0x06, res);//set register 0
    return 0;
}
bool LED_IND1_off(){
    MUX_set(1,1,1,1);
    //make sure GPIOEXP1_init was run before this function.
    //see explanation in LED_BT_blue and LED_PWR_red
    uint8_t res = readi2cOneByte(0x22, 0x04); //read LED register 0
    res = (res | 0x70); //forces the red blue and green bits to be 1
    writei2cSingle(0x22, 0x04, res);//set register 0
    return 0;
}
bool LED_IND2_off(){
    MUX_set(1,1,1,1);
    //make sure GPIOEXP1_init was run before this function.
    //see explanation in LED_BT_blue and LED_PWR_red
    uint8_t res = readi2cOneByte(0x22, 0x04); //read LED register 0
    uint8_t res1 = readi2cOneByte(0x22, 0x05); //read LED register 1
    res = (res | 0x80); //forces the blue bit to be a 0
    res1 = (res1 | 0x3); //forces the red and green bits to be 1
    writei2cSingle(0x22, 0x04, res);//set register 0
    writei2cSingle(0x22, 0x05, res1);//set register 0
    return 0;
}
bool LED_IND3_off(){
    MUX_set(1,1,1,1);
    //make sure GPIOEXP1_init was run before this function.
    //see explanation in LED_BT_blue and LED_PWR_red
    uint8_t res = readi2cOneByte(0x22, 0x06); //read LED register 0
    res = (res | 0x08); //forces the blue bit to be a 1
    res = (res | 0x06); //forces the red and green bits to be 1
    writei2cSingle(0x22, 0x06, res);//set register 0
    return 0;
}
bool LED_IND4_off(){
    MUX_set(1,1,1,1);
    //make sure GPIOEXP1_init was run before this function.
    //see explanation in LED_BT_blue and LED_PWR_red
    uint8_t res = readi2cOneByte(0x22, 0x06); //read LED register 0
    res = (res | 0x70); //forces the red and green bits to be 1
    writei2cSingle(0x22, 0x06, res);//set register 0
    return 0;
}


bool LED_ALL_off(){
    MUX_set(1,1,1,1);
    writei2cSingle(0x22, 0x04, 0xFF);
    writei2cSingle(0x22, 0x05, 0xFF);
    writei2cSingle(0x22, 0x06, 0xFF);
    writei2cSingle(0x23, 0x04, 0xFF);
    writei2cSingle(0x23, 0x05, 0xFF);
    writei2cSingle(0x23, 0x06, 0xFF);
    return 0;
}
void LED_indicator_init(){
        //configuration registers set all outputs to outputs instead of default input
        writei2cSingle(0x23, 0x0C, 0x0); 
        writei2cSingle(0x23, 0x0D, 0x0); 
        writei2cSingle(0x23, 0x0E, 0x0); 
}
void LED_vertBoard_init(){
        //configuration registers set all outputs to outputs instead of default input
        writei2cSingle(0x22, 0x0C, 0x0); 
        writei2cSingle(0x22, 0x0D, 0x0); 
        writei2cSingle(0x22, 0x0E, 0x0); 
}

bool LED_WHITE_on(){
    //make sure GPIOEXP1_init was run before this function.
    //read current GPIOEXP1 settings:
    
