kitcyte3/bandCode-SES/examples/ble_peripheral/ble_app_hrs_nrf51_ses/main.c
    //LEDS WORK, BUT THIS DRIVER FUNCTION HASNT BEEN IMPLEMENTED CORRECTLY YET  
    writei2cSingle(0x22, 0x04, 0xF7);
    writei2cSingle(0x22, 0x05, 0x7F); 
    writei2cSingle(0x22, 0x06, 0x7E); 
    
    return 0;
}

void MUX_set(bool s3, bool s2, bool s1, bool s0){
    s3?nrf_gpio_pin_set(2):nrf_gpio_pin_clear(2);
    s2?nrf_gpio_pin_set(1):nrf_gpio_pin_clear(1);
    s1?nrf_gpio_pin_set(0):nrf_gpio_pin_clear(0);
    s0?nrf_gpio_pin_set(30):nrf_gpio_pin_clear(30);
}

void vibro_start(){
    nrf_gpio_pin_set(14);
}
void vibro_stop(){
    nrf_gpio_pin_clear(14);
}

bool RGBW_on(){
        //turns RGBW sensor on, returns 0 if success, 1 if falied
                    //addr,  reg,  hi, low
        writei2c(0x10,0x00,0x00,0x00); //enable RGBW sensors with 80ms integration time

        //read back settings
        uint16_t i2cResult = readi2cHighLow(0x10, 0x00);
    
        return i2cResult != 0x00;
}
bool RGBW_off(){
        //turns RGBW sensor on, returns 0 if success, 1 if falied
                    //addr,  reg,  hi, low
        writei2c(0x10,0x00,0x00,0x01); //enable RGBW sensors with 80ms integration time

        //read back settings
        uint16_t i2cResult = readi2cHighLow(0x10, 0x00);
    
        return i2cResult != 0x01;
}
double* RGBW_get(){
    //returns an array of doubles, max value is 255 for each color, skips matrix multiplications
    bool printResult = true;
    static double RGBreturn[3] = {0,0,0};
    double r,g,b, w;
    
    //read colors
    r = readi2cHighLow(0x10, 0x08);// *100 / 96.0;  
    g = readi2cHighLow(0x10, 0x09);// *100 / 74.0;
    b = readi2cHighLow(0x10, 0x0A);// *100 / 56.0;
    w = readi2cHighLow(0x10, 0x0B);
    
    //do some math
    double normalizedR = r;
    double normalizedG = g;
    double normalizedB = b;
    normalizedR = normalizedR/255;
    normalizedG = normalizedG/255;
    normalizedB = normalizedB/255;
    int hexR, hexB, hexG;
    hexR = normalizedR;
    hexB = normalizedB;
    hexG = normalizedG;
    
    if(printResult){
        printf("  raw red: 0x%x\r\n",r );
        printf("raw green: 0x%x\r\n",g );
        printf(" raw blue:  0x%x\r\n",b );
        printf("raw white:  0x%x\r\n",w );
        printf("RGB: %x %x %x\r\n\r\n",hexR,hexG,hexB);
    }
    RGBreturn[0]= hexR;
    RGBreturn[1]= hexB;
    RGBreturn[2]= hexG;
    
    return RGBreturn;
    
}
 
void band_uart_init(){
uint32_t err_code;
    const app_uart_comm_params_t comm_params =
      {
          //RX_PIN_NUMBER,
          //TX_PIN_NUMBER,
                    9,
                    10,
                    12,
                    11,
          //RTS_PIN_NUMBER,
          //CTS_PIN_NUMBER,
          APP_UART_FLOW_CONTROL_ENABLED,
          false,
          UART_BAUDRATE_BAUDRATE_Baud9600
      };

    APP_UART_FIFO_INIT(&comm_params,
                         UART_RX_BUF_SIZE,
                         UART_TX_BUF_SIZE,
                         uart_error_handle,
                         APP_IRQ_PRIORITY_LOWEST,
                         err_code);

    APP_ERROR_CHECK(err_code);
    printf("\r\nUART works\r\n");
}

void scan_twi(){ //works 12/27/2019
    //check for TWI dvices
    uint8_t sample_data;
    uint8_t address;
    uint32_t err_code;
    for (address = 1; address <= 127; address++){
        err_code = nrf_drv_twi_rx(&m_twi, address, &sample_data, sizeof(sample_data));
        if (err_code == NRF_SUCCESS)
        {
            printf("TWI device detected at address 0x%x.\r\n", address);
        }
    }
}

void scan_twi1(){

    
    //check for TWI dvices
    uint8_t sample_data;
    uint8_t address;
    uint32_t err_code;
    for (address = 1; address <= 127; address++){
        err_code = nrf_drv_twi_rx(&m_twi1, address, &sample_data, sizeof(sample_data));
        if (err_code == NRF_SUCCESS)
        {
            printf("TWI1 device detected at address 0x%x.\r\n", address);
        }
    }
}

void LED_demo(){
    LED_indicator_init();
    LED_BT_blue();
    LED_PWR_yellow();
        
    int delayTime = 300;
    
    hi:
    
    for(int i = 0; i< 4; i++){
        LED_BT_blue();
        LED_PWR_red();
        nrf_delay_ms(delayTime);
        LED_BT_off();
        LED_PWR_off();
        nrf_delay_ms(delayTime);
    }
    for(int i = 0; i< 4; i++){
        LED_BT_blue();
        LED_PWR_yellow();
        nrf_delay_ms(delayTime);
        LED_BT_off();
        LED_PWR_off();
        nrf_delay_ms(delayTime);
    }
    for(int i = 0; i< 4; i++){
        LED_BT_blue();
        LED_PWR_green();
        nrf_delay_ms(delayTime);
        LED_BT_off();
        LED_PWR_off();
        nrf_delay_ms(delayTime);
    }
    LED_PWR_green();
    LED_BT_green();
    nrf_delay_ms(4*delayTime);
    LED_PWR_off();
    LED_BT_off();
    
    while(true){
        if(nrf_gpio_pin_read(3)==0){
            goto hi;
        }
        if(nrf_gpio_pin_read(5) == 0){
            goto hi;
        }
    }
}

void VIBRO_test(){
    //vibro tests
    vibro_init();
    while(true){
        //vibration motor test
        vibro_start();
        nrf_delay_ms(1000);
        vibro_stop();
        nrf_delay_ms(1000);
    }
    //vibro results V2: The voltage at the motor is 0.2V too low for the motor to run
    //to fix, choose another MOSFET or connect Vibro to VUSB
}

void bt_btn_handler(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action){
  //place code here to run when the bluetooth button is pressed
 printf("bt button pressed!\r\n");
 ble_advertising_start(BLE_ADV_MODE_FAST);
    LED_BT_blue();
    nrf_delay_ms(200);
    LED_BT_off();
    
}
void pwr_btn_handler(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action){
    //place code here to run when the power button is pressed
    printf("pwr button pressed!\r\n");
    LED_PWR_red();
    nrf_delay_ms(200);
    LED_PWR_off();
}
void button_init_interrupt(){
    int pwr_pin = 5;
    int bt_pin = 3;
    ret_code_t err_code;


        //set up GPIOTE drivers - apparentnly already done somewhere else. if below is uncommented, nrf goes in reboot loop because err_code is nonzero, and app error check reboots nrf when error_code is non-success
    if(!nrf_drv_gpiote_is_init()){
      err_code = nrf_drv_gpiote_init();
    }
    APP_ERROR_CHECK(err_code);

    printf("hiz\n");
    
    //set the pin we want to be a sense pin
    nrf_drv_gpiote_in_config_t in_config = GPIOTE_CONFIG_IN_SENSE_HITOLO(true);
    in_config.pull = NRF_GPIO_PIN_PULLUP;

        //attach GPIO tasker to power button
    err_code = nrf_drv_gpiote_in_init(pwr_pin, &in_config, pwr_btn_handler);
    APP_ERROR_CHECK(err_code);
    nrf_drv_gpiote_in_event_enable(pwr_pin, true);
    
