kitcyte3/bandCode-SES/examples/ble_peripheral/ble_app_hrs_nrf51_ses/main.c
    //attach GPIO event to bluetooth button
    err_code = nrf_drv_gpiote_in_init(bt_pin, &in_config, bt_btn_handler);
    APP_ERROR_CHECK(err_code);
    nrf_drv_gpiote_in_event_enable(bt_pin, true);
}
int prox_get(){
    ret_code_t err_code;
    //read VCNL prox snesor data
    uint8_t address = 0x60; //0x60  for prox                    
    uint8_t dataToSend2[3] = {0x03,0x00,0x00};
    err_code = nrf_drv_twi_tx(&m_twi, address, &dataToSend2[0], sizeof(dataToSend2), false);
    
    //first half of read
    uint8_t dataToSend[1] = {0xF2};
    err_code = nrf_drv_twi_tx(&m_twi, address, &dataToSend[0], sizeof(dataToSend), true);


    uint8_t read_data[2];
    err_code = nrf_drv_twi_rx(&m_twi, address, &read_data[0], 2);
    //printf("recieved: 0x%x 0x%x\r\n",read_data[1], read_data[0]);
    if (err_code == NRF_SUCCESS){}
    nrf_delay_ms(50);
    int toReturn = (read_data[1]<<8) | read_data[0];
    return toReturn; //return address to first element of array
}
int* scanAllProx(){
  //returns the prox data from all 4 prox sensors starting from the USB side
  //in this format: [prox1, prox1, prox2, prox2, prox3, prox3, prox4]

  static int proxData[4]={0,0,0,0}; //being very explicit
  //starting from the USB side
  MUX_set(0,1,1,0); // I6
  proxData[0]=prox_get(); 
  MUX_set(0,1,1,1); // I7
  proxData[1]=prox_get();
  MUX_set(0,0,1,1); // I3
  proxData[2]=prox_get();
  MUX_set(0,0,1,0); // I2
  proxData[3]=prox_get();

  //print out all info
  /*
  printf("all prox data:\n");
  for(int i = 0; i< 4; i++){
    printf("%x \n",proxData[i]);
  }
  */
  return proxData;

}
//===============================END SENSOR STUFF=====================================

/**@brief Function for application main entry.
 */
int main(void)
{
    band_uart_init();       // setup UART
    uint32_t err_code;
    bool     erase_bonds;

    // Initialize.
    err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

   
    timers_init();
    application_timers_start();

      ble_stack_init();
      peer_manager_init(erase_bonds);
      if (erase_bonds == true)
      {
          NRF_LOG_INFO("Bonds erased!\r\n");
      }
    
    //sensor code
    //These are direct NRF GPIO
    MUX_init();                     //setup nrf GPIO to output
    MUX_set(1,1,1,1);       //1111 for SDA -> LEDs  (s3 s2 s1 s0)
    
    
    //buttons
    //button_init_simple();
    printf("before button init");
    button_init_interrupt(); //turns on BT light when button pressed
    printf("after button init");
        
    //then do twi init, since it tends to get stuck here
    twi_init();
    //twi1_init();
    
    nrf_delay_ms(1000);
    scan_twi(); // do a twi scan
    //scan_twi1();
    
    
    //indicator LED stuff on 0x23 expander
    LED_indicator_init();
    
    //LED_demo();
    LED_PWR_yellow();
    LED_ALL_off();
    

    
    //indicator LED stuff on 0x22 expander
    LED_vertBoard_init();
    //LED_WHITE_on();
    MUX_set(1,1,1,1);
     //THESE WORK
     /*
    LED_IND1_blue();
    nrf_delay_ms(500);
    LED_IND2_blue();
    nrf_delay_ms(500);
    LED_IND3_blue();
    nrf_delay_ms(500);
    LED_IND4_blue();
    nrf_delay_ms(500);
    LED_IND1_off();
    nrf_delay_ms(500);
    LED_IND2_off();
    nrf_delay_ms(500);
    LED_IND3_off();
    nrf_delay_ms(500);
    LED_IND4_off();
    nrf_delay_ms(500);
    LED_IND4_blue();
    LED_IND3_blue();
    nrf_delay_ms(500);
    LED_IND2_off();
    nrf_delay_ms(500);
    LED_IND1_off();
    nrf_delay_ms(500);
    */
    
    //LED_demo();
    
    //RGBW setup
    MUX_set(0,0,1,1);
    RGBW_on();

    MUX_set(1,1,1,1);
    //end sensor code   
    
    
      while(m_custom_value <= 1)
      {
        power_manage();
      } 
      gap_params_init();
      services_init();
      advertising_init();
      conn_params_init();

      // Start execution.
      //NRF_LOG_INFO("Template started\r\n");
    

    // Enter main loop.
    while(true){
        bool LED_IND_on[4]={false,false,false,false};
        int* proxReturn= scanAllProx();
        for(int i = 0; i<4; i++){
          printf("%x ",proxReturn[i]);
          if(proxReturn[i] >= 0x20){ //let 0x20 be the prox threshold for item detected
            //turn on blue leds corresponding to the thing.
            printf("prox sensor %d activated",i);
            if(i==0){
              LED_IND1_blue();
              LED_IND_on[0]=true;
            }if(i==1){
              LED_IND2_blue();
              LED_IND_on[1]=true;
            }
            if(i==2){
              LED_IND3_blue();
              LED_IND_on[2]=true;
            }
            if(i==3){
              LED_IND4_blue();
              LED_IND_on[3]=true;
            }
          }
        }
        printf("\n");
        for(int i = 0; i<4; i++){
          if(LED_IND_on[i] == false){
            if(i==0){
              LED_IND1_off();
            }else
            if(i==1){
              LED_IND2_off();
            }else
            if(i==2){
              LED_IND3_off();
            }else
            if(i==3){
              LED_IND4_off();
            }
          }
        }
        if (NRF_LOG_PROCESS() == false){
            power_manage();
        }
    }
}


/**
 * @}
 */
